Tekla Open API Reference for Tekla Structures 2025
GraphicsDrawer.DrawText Method
 Draws a temporary text in the currently active rendered view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DrawText(
	Point Location,
	string Text,
	Color Color
)
Public Function DrawText (
	Location As Point,
	Text As String,
	Color As Color
) As Boolean
Parameters
Location
Type: Tekla.Structures.Geometry3d.Point
The location of the text's top-left corner.
Text
Type: System.String
The text to be drawn. The maximum length is 511 characters.
Color
Type: Tekla.Structures.Model.UI.Color
The color of the text. The transparency value of the color is ignored.
Return Value
Type: Boolean
True on success.
See Also
Reference
GraphicsDrawer Class
Tekla.Structures.Model.UI Namespace